 
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Комментарий = "" Тогда
		Открытие = Ложь;
		Гсч = Новый ГенераторСлучайныхЧисел;
		ЧислоВставки = Гсч.СлучайноеЧисло(0, 412444);
		Комментарий = СтрШаблон("Сегодня хорошая погода и число: %1", ЧислоВставки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ДатаЗаписи = Объект.Дата Тогда
		Отказ = Истина;
		Сообщить("Нельзя записываться день в день");
	КонецЕсли;
	
	ПроверитьКлиента();
	
КонецПроцедуры

 &НаСервере
Функция ПроверитьКлиента()

	Если Объект.Контрагент.ТипКонтрагента = Перечисления.ТипКонтрагента.Клиент Тогда
		Сообщить("Это клиент");	
	КонецЕсли;
	
КонецФункции