
&НаКлиенте
Асинх Процедура ПрочитатьКартинкуНоменклатуры()

	ПараметрыПомещенияФайла = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыПомещенияФайла.Фильтр = "Картинка (*.jpg)|*.jpg";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыПомещенияФайла, УникальныйИдентификатор);
	
	Если ОписаниеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКартинки = ОписаниеФайла.Адрес;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ПустаяСтрока(ПутьКартинки) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПутьКартинки);
		ТекущийОбъект.ФайлКартинки = Новый ХранилищеЗначения(ДвоичныеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДвоичныеДанные = ТекущийОбъект.ФайлКартинки.Получить();
	Если ДвоичныеДанные <> Неопределено Тогда
		ПутьКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьКартинку(Команда)
	
	АдресРезультата = ПодготовитьКартинку();
	
	Если ПустаяСтрока(АдресРезультата) Тогда
		Возврат;
	КонецЕсли;
		
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".jpg");
	ИмяФайла = Строка(Объект.Сотрудник);
	Расширение = ".jpg";
	ПолучитьФайлССервераАсинх(АдресРезультата, ИмяВременногоФайла);
	
	ПараметрыПолученияФайла = Новый ПараметрыДиалогаПолученияФайлов;
	ПараметрыПолученияФайла.ВыборКаталога = Ложь;
	ПараметрыПолученияФайла.Каталог = КаталогВременныхФайлов();

КонецПроцедуры


&НаСервере 
Функция ПодготовитьКартинку()

	ДвоичныеДанныеИзображения = ПолучитьИзВременногоХранилища(ПутьКартинки);
	
	Если ДвоичныеДанныеИзображения = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Картинка номенклатуры не загружена";
		Сообщение.Сообщить();
		Возврат "";
		
	КонецЕсли;
	
	Картинка = Новый Картинка(ДвоичныеДанныеИзображения);
	
	ОбрабатываемяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
	ОбрабатываемяКартинка.УстановитьРазмер(600, Неопределено);
	
	Картинка = ОбрабатываемяКартинка.ПолучитьКартинку();
	ДвоичныеДанныеИзображения = Картинка.ПолучитьДвоичныеДанные();

	АдресРезультата = ПоместитьВоВременноеХранилище(ДвоичныеДанныеИзображения, УникальныйИдентификатор); 
	Возврат АдресРезультата;

	
КонецФункции


&НаКлиенте
Процедура ПутьКартинкиНажатие(Элемент, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	
	ПрочитатьКартинкуНоменклатуры();
КонецПроцедуры

