
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокДоступныхКонтрагентов = Новый СписокЗначений;
	ВыборкаКонтрагентов = Справочники.Контрагенты.Выбрать();
	Пока ВыборкаКонтрагентов.Следующий() Цикл
		
	КонецЦикла;
	
	Если Объект.Поставщик.ТипКонтрагента = Перечисления.ТипКонтрагента.Клиент Тогда
		Элементы.ДоговорПоставщика.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Комментарий = "" Тогда
		Объект.Комментарий = "Очередная запись";		
	КонецЕсли;
	
КонецПроцедуры
